#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
#map2 = affine_map<(d0, d1) -> (d1)>
module {
  func.func @forward(%arg0: tensor<1x3x32x32xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant dense_resource<torch_tensor_6_3_5_5_torch.float32> : tensor<6x3x5x5xf32>
    %cst_0 = arith.constant 0.000000e+00 : f32
    %cst_1 = arith.constant dense_resource<torch_tensor_16_6_5_5_torch.float32> : tensor<16x6x5x5xf32>
    %cst_2 = arith.constant dense_resource<torch_tensor_120_400_torch.float32> : tensor<120x400xf32>
    %cst_3 = arith.constant dense_resource<torch_tensor_120_torch.float32> : tensor<120xf32>
    %cst_4 = arith.constant dense_resource<torch_tensor_84_120_torch.float32> : tensor<84x120xf32>
    %cst_5 = arith.constant dense_resource<torch_tensor_84_torch.float32> : tensor<84xf32>
    %cst_6 = arith.constant dense_resource<torch_tensor_10_84_torch.float32> : tensor<10x84xf32>
    %cst_7 = arith.constant dense_resource<torch_tensor_10_torch.float32> : tensor<10xf32>
    %0 = tensor.empty() : tensor<1x6x14x14xf32>
    %1 = linalg.fill ins(%cst_0 : f32) outs(%0 : tensor<1x6x14x14xf32>) -> tensor<1x6x14x14xf32>
    %2 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%arg0, %cst : tensor<1x3x32x32xf32>, tensor<6x3x5x5xf32>) outs(%1 : tensor<1x6x14x14xf32>) -> tensor<1x6x14x14xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%2 : tensor<1x6x14x14xf32>) outs(%0 : tensor<1x6x14x14xf32>) {
    ^bb0(%in: f32, %out: f32):
      %25 = arith.cmpf ugt, %in, %cst_0 : f32
      %26 = arith.select %25, %in, %cst_0 : f32
      linalg.yield %26 : f32
    } -> tensor<1x6x14x14xf32>
    %4 = tensor.empty() : tensor<1x16x5x5xf32>
    %5 = linalg.fill ins(%cst_0 : f32) outs(%4 : tensor<1x16x5x5xf32>) -> tensor<1x16x5x5xf32>
    %6 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%3, %cst_1 : tensor<1x6x14x14xf32>, tensor<16x6x5x5xf32>) outs(%5 : tensor<1x16x5x5xf32>) -> tensor<1x16x5x5xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%6 : tensor<1x16x5x5xf32>) outs(%4 : tensor<1x16x5x5xf32>) {
    ^bb0(%in: f32, %out: f32):
      %25 = arith.cmpf ugt, %in, %cst_0 : f32
      %26 = arith.select %25, %in, %cst_0 : f32
      linalg.yield %26 : f32
    } -> tensor<1x16x5x5xf32>
    %collapsed = tensor.collapse_shape %7 [[0], [1, 2, 3]] : tensor<1x16x5x5xf32> into tensor<1x400xf32>
    %8 = tensor.empty() : tensor<400x120xf32>
    %transposed = linalg.transpose ins(%cst_2 : tensor<120x400xf32>) outs(%8 : tensor<400x120xf32>) permutation = [1, 0] 
    %9 = tensor.empty() : tensor<1x120xf32>
    %10 = linalg.fill ins(%cst_0 : f32) outs(%9 : tensor<1x120xf32>) -> tensor<1x120xf32>
    %11 = linalg.matmul ins(%collapsed, %transposed : tensor<1x400xf32>, tensor<400x120xf32>) outs(%10 : tensor<1x120xf32>) -> tensor<1x120xf32>
    %12 = linalg.generic {indexing_maps = [#map1, #map2, #map1], iterator_types = ["parallel", "parallel"]} ins(%11, %cst_3 : tensor<1x120xf32>, tensor<120xf32>) outs(%9 : tensor<1x120xf32>) {
    ^bb0(%in: f32, %in_10: f32, %out: f32):
      %25 = arith.addf %in, %in_10 : f32
      linalg.yield %25 : f32
    } -> tensor<1x120xf32>
    %13 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%12 : tensor<1x120xf32>) outs(%9 : tensor<1x120xf32>) {
    ^bb0(%in: f32, %out: f32):
      %25 = arith.cmpf ugt, %in, %cst_0 : f32
      %26 = arith.select %25, %in, %cst_0 : f32
      linalg.yield %26 : f32
    } -> tensor<1x120xf32>
    %14 = tensor.empty() : tensor<120x84xf32>
    %transposed_8 = linalg.transpose ins(%cst_4 : tensor<84x120xf32>) outs(%14 : tensor<120x84xf32>) permutation = [1, 0] 
    %15 = tensor.empty() : tensor<1x84xf32>
    %16 = linalg.fill ins(%cst_0 : f32) outs(%15 : tensor<1x84xf32>) -> tensor<1x84xf32>
    %17 = linalg.matmul ins(%13, %transposed_8 : tensor<1x120xf32>, tensor<120x84xf32>) outs(%16 : tensor<1x84xf32>) -> tensor<1x84xf32>
    %18 = linalg.generic {indexing_maps = [#map1, #map2, #map1], iterator_types = ["parallel", "parallel"]} ins(%17, %cst_5 : tensor<1x84xf32>, tensor<84xf32>) outs(%15 : tensor<1x84xf32>) {
    ^bb0(%in: f32, %in_10: f32, %out: f32):
      %25 = arith.addf %in, %in_10 : f32
      linalg.yield %25 : f32
    } -> tensor<1x84xf32>
    %19 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%18 : tensor<1x84xf32>) outs(%15 : tensor<1x84xf32>) {
    ^bb0(%in: f32, %out: f32):
      %25 = arith.cmpf ugt, %in, %cst_0 : f32
      %26 = arith.select %25, %in, %cst_0 : f32
      linalg.yield %26 : f32
    } -> tensor<1x84xf32>
    %20 = tensor.empty() : tensor<84x10xf32>
    %transposed_9 = linalg.transpose ins(%cst_6 : tensor<10x84xf32>) outs(%20 : tensor<84x10xf32>) permutation = [1, 0] 
    %21 = tensor.empty() : tensor<1x10xf32>
    %22 = linalg.fill ins(%cst_0 : f32) outs(%21 : tensor<1x10xf32>) -> tensor<1x10xf32>
    %23 = linalg.matmul ins(%19, %transposed_9 : tensor<1x84xf32>, tensor<84x10xf32>) outs(%22 : tensor<1x10xf32>) -> tensor<1x10xf32>
    %24 = linalg.generic {indexing_maps = [#map1, #map2, #map1], iterator_types = ["parallel", "parallel"]} ins(%23, %cst_7 : tensor<1x10xf32>, tensor<10xf32>) outs(%21 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_10: f32, %out: f32):
      %25 = arith.addf %in, %in_10 : f32
      linalg.yield %25 : f32
    } -> tensor<1x10xf32>
    return %24 : tensor<1x10xf32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_6_3_5_5_torch.float32: "0x04000000903E4FBBC7C0AFBD5B1E4CBDBE5A5CBD8549983DE819A1BDA43D2BBDC2CD5F3D4B5CBCBD04BD5F3DDA631BBD88B0C03D9367AF3DC17DC5BD328937BD8A00DCBDB44F153D2421CE3D22198F3D82A7DA3D75F5B5BD392700BDCF2C0E3D69B37ABCF00192BD29B3CEBD8D6DB73D9381A6BD5893BC3DAFEC6BBD9CAEC8BD94CF843BD21ED83DC9C69C3DF70D223C7241143DF945D43D4A199C3DA5D975BCC531B5BD537AE63D830698BDA880B13D25C244BD7A6ED3BD44FE0C3C25A92BBD1FD41E3CD4AD60BC19C982BD56CCB53D52BEB53CEB3089BD32AEBA3C1E07BBBD654508BD652298BDD29AD0BBB4C69D3D0EC8A9BD55AF72BD192223BDF60DA63DFA3266BD654CD73D70D99DBBC557C33BDBB873BBC815A9BD088BD93DBC49963D7E4F5F3C28A829BD285DCEBDCA076C3D649D4BBDAA5B1C3DD9314F3D6070ACBC6F027BBDB239A83D0BAEE33D10C5ACBDED82F53C019236BCF8BCDB3DD680AC3D84047F3CB32E913D5F8E5C3D3EF2C23CBE77EA3DC7EFF83CEB77333DF138EA3C58D15C3DF55898BDCFC99ABD20C0913D42E7F9BC0B55DBBB405C88BD2B7440BD9CC975BD168A39BDB2068A3D654EE9BC4F80403BA52FE13DD415B9BD1A63563DEE9AE6BC867E02BC39CC8C3DF61CC83D36B6E8BDDA50B3BDDA27FEBC89EBE33DB915B9BDAA94703C25F1C8BDB3C345BD784E22BDF0BF1CBDA4873B3D768AAF3C8989A6BC9DBAAA3D5BF764BD49F5C13DA0738D3DA883C0BB88E68BBD4A0FB73B85F0D8BD5513DABD04837E3C3FF1AABCBFB2B7BDEC578CBD362880BDAADE76BD5625973D5288B83DCAC1D4BD77DBC33CD71910BD3BA92C3D03649A3C11F2AFBCD774BB3DD198ADBDFE67D2BDF2ACBBBDD026023D30E47DBD8459BCBDA400B43D28F60F3D1B01353D272DDCBDFB2B33BD9471A83D8B43F23B195D6ABD4246183DD1668CBDEDC8B3BD20F2A5BDC90FABBA9D2D993D45F80D3DF03E8EBDE168C43D41B4C13D7EDF703DD2A847BB0D85E5BC185814BDB2FFE0BAB34CBEBDDED8C23C83F553BCC4BC9FBD5F9A563DF268A5BB7EA3BD3D0C7744BDDDD73B3DA7190B3D4A5013BBF1EFD13D733A543CCCB1A63D053F15BD379CE6BD84F181BDFBD8A5BC126E1BBDAD46353DFED7233D862A79BCC0559EBD39A6503D4ACB0F3D35E95BBDCC7E613D2FBBB93DDBEEE93D3F7D833DEB212A3D7712E7BD1455DABD766CBB3BDAE2C6BDFD21E2BB8818E0BD53C0A1BDD272E13DB59C4D3D1A8F72BD719E97BD3A82A0BD460AC93DB892B83D08EA97BDC5C2653DEEBBA43D2336953DCB6ACD3CC037F7BC0C7F1FBD197A69BD6D8C9A3BAB0CEC3D0B40253D4D62B43D55CCCABDF2F2353CDFEFB73D0322773D197390BDF76F7E3BBA5707BD77CD163D8FA0D2BDA53001BC082ABDBC402CB5BC50F89FBDEE1BB6BDC7ADDD3D461144BC1938CF3C7FCBBB3CE108423DEBE4AC3DD628E03CA908793D9504F23C09FD71BDB621A93D47B7B43CFC09623D504DE9BD08FFABBD7FBCA33CB11B4ABDE6A76D3D4A6D213CA54F913DE92BABBD2DA2ADBD52C62ABD4443323D13609F3C5C2ECABD522C22BD22A93E3DF011F5BC4CAAE83DDBB33ABD1D0743BC518E20BD19236CBD7790A5BD3E51443DD75F33BCAC34243D2E6816BABFC1CCBDA6F458BD2DCF813DFF48C13DB803923D4F0E3CBD0F61D9BC160AE6BD2F3DCFBD9E9BDBBD0906693D7D3F0EBDF203873DF466923DFA0F853DEBED5E3D55F5D6BB579FD53DE19FEBBC6F66E13C515B723D517F9E3DBC589C3DE8F0933D0D591DBD8105053D9489BF3CDD14D1BDB9A9B5BDC0FA89BD6A920C3D2126C7BDD30FF83CFAD8313DB243793C2573E83CCB1793BDB658D83D8C59D13D780BC53C434F723C7D41A43C13D0433D063AA03D3B4DCC3D644FE33D0CF1413DF77E3CBD755A91BA15DEBFBDA32EC03DCED032BD86B4BDBDE84B5C3D60B4E1BD48BFE3BD0308843D70294DBD452C01BD011D63BD08CBB9BD5B5A2FBD7564203D5108DABD1BC7B6BD00FB5C3D11B8A73C57C73ABDD8D333BDE4F5A6BDC5697FBD6C27D53C6BE98D3B63472A3C0ABD563D41568FBD824AA93C6CBA81BD8F8C5F3D70B5A83D960E713DA841D7BB6109A1BC82999EBDB23EBA3D565299BDAEA6203CB12EE33D5E61BE3BD6CE243D1912993D1EF2E63DFE7A863D43B9D5BC7378663D203437BC3F0E4D3D9026AB3C64C9C33D567A263DCFDCC93D4F8EC83DAB31DDBD8C51A1BD844C8D3D5D55B3BD705C94BC772E6A3D5429EB3DEDC586BD7276E43C1B6E77BD57E2D0BDFCA9C339A13DD3BB32C4E13CAD0ADA3DB7653DBD933E4BBDB48A44BDDE805BBDC1D119BD36555EBD0CB7A3BDB9E9A0BD3C21D93DE962B0BBBFE70C3C14295BBD2053243CC45866BDCBC1963D15D8BA3C049B5C3832FA29BD9360253CE5ABFD3AB485A3BC4BDCEB3D72EED6BD9FBE4EBD760B3D3C6D67593D0E25D53CB758BCBD748ABF3DA94AA73C462F4CBCEB1FC1BC7DF4DF3D1941D6BD8846C5BDFE55A33DD5C0493D37786CBCAA05313C5487D2BC91781F3D4413CEBC",
      torch_tensor_16_6_5_5_torch.float32: "0x0400000039596BBD8BDB2F3DA5C5923CBC9B043D587897BD6552953DFFD91C3D37A52CBDF2E1783D47DF89BD6717A6BD2A260F3D468B16BDEF70793D111B9DBDD3D16D3D83449FBD5A71DEBCB46286BDE27B823DCF1F9F3D47C4A53D808E733C40E90CBD9370A3BD8AAB06BDD1D691BD4A37A1BCD9D1F7BC9E216E3D829E81BDA83855BD76855F3DDA72923C0013143B2BC0BCBC064B80BD6561A2BD066C99BDB25599BDB8910B3D8AD24E3C17A5793DEEB9DF3C678F9D3CFEF693BD0617043D05CA803D8BB0CFBCF40A553CC8D48B3DDF9CA2BD45C6893D6C241039A74A993D051C873BBB6C333DE9B73B3D9749963DF76975BD820D87BCD5B916BBC85C8E3DD75EA43D26FF703D9AE3133DA2DA7E3D922490BD480A873C3EFAE0BC587AAE3CF1359BBD1E8C8FBD82BA04BB60C72239565B243DB5C291BD3A6A283D954B8FBCDDD106BD0C26463D757B183DA26D11B9B7E726BC7B592D3D495451BD87A7D63CD0729C3CCE96113D2AFD1BBDBF510FBDBD96D2BBE34D5A3D63D004BD011AA1BD6E90F9BCC388473C6A33973D65C8713DA387383CACCEDCBC33BAEE3BA54A573DCD62E33CBA23983CCE4356BD7CB4543AB87C6F3D96AFEE3B254F7EBDD5A8C7BC5C04F43C5C2C81BC4206953D3FE77A3D4E39A33DB81927BDBCE275BDF7D92D3C6489493D565A993D3380353D75265E3D62EB083CF23D753D4EC884BBD4E0923D2CDA5B3CEF96563D2DB0ABBB1FD47EBD6DBEF3BC4C697C3C3A734F3D1EE8393D9D9C9FBD4385BEBB96CB0F3B0A8190BDF478433DFEB62BBC382B8CBDB6A0703DF4A858BDEEA24BBD4523833D9A492FBD6755533DC7BD683DB586EDBBA3244EBD624E3ABC299F263DF763CE3CDAF3983DCFA92B3CBFC02D3D9949203D8DC973BD267E1FBD1475333D4DCC0A3CBF80A23CF8C39A3C4E6394BDBCDB45BD63270A3D33AE983D4B1C863CD8CC2FBC7B097C3DD39707BD86D7A53DBCE032BD8E66213D0E2795BBBF0F0DBD3C684BBBB63D253A14FAA2BB87F1953CEF37A53DB2E7713D34C6933D49D087BD07D7A03B452210BD4ED39EBC1064893920159F3DC2F879BD00B190BDD3B889BDB7BFA5BD72BA163D8DC2823DAFCB9FBD28ED7F3B1004D1BC018A143DEFCE02BD2B8F2B3DA0643BBD825ACC3C10D58B3DC040FD3C9497B3BCE774703D1184A53D45E669BBA7B29EBD46B580BCD7C863BDB3C4413C89A6433DE78ADCBCD3339C3D8F0E18BC5B8A813D006F9C3D7DD7A63C95DB7B3D0C41BBBC3DA6963B47164BBD39DB3C3D4868523DE0655BBD03862ABD5947F2BCDCAC4FBD8EBF903D3252963DE8BEEFBB238488BD2644F9BA458E26BD95916B3D1B54F2BBC4A981BD1090983D2881413DEDCD81BD1BBA9B3D97DB023C72B89CBD554474BC716E7CBD29F7A7BB0E749FBC2171183DAD1E91BDB5F292BD35AF4A3D0D31353C776D3B3DA356723C0B3C2D3DCA73BEBC6B0915BC05D29EBBEC6CAD3CAF1F8B3D3B24BDBC81EEF5BC9D4C9DBDD22BABBB4A32333C68E835BD7625E83C1D1E213D729053BDF132793D74D45E3C99ED1E3D9E8CE43C997498BD515AEF3BC7B722BC5B5631BC44D73DBD18522B3D7CF625BC837CB0BCF64228BD4D8B81BDC0E803BD40F02F3D74675E3C175D94BDEF4F3ABC5353543D6F3219BD751C863D7A2A1BBD08FE4F3A81168FBDBF5840BC54D528BD6DC5993C2885873DB3B88A3D14219F3C8C30A7BDB71589BD3B66853DDD4F4BBCBF96E63BE06C9EBD16A574BC8E739BBB383D953DC36F073DA2052CBDF35D3BBCBD0D05BDE2755A3D31BDF7BC92E00ABD116A933CA7A964BDB47860BB23B36E3C338D15BA6BD01E3D55DE2DBC04BC073C8576903CDAB9B83B0B333BBD6F95D2BBF1C4973D15EDA3BDF23D94BC14E39D3DC76912BDA38E2ABD761BAFBC9EFBBBBC893056BD353FEABCA5D8583D04A4A5BC10AA6D3C3EAB8BBDA717453D3BF0103D7E4A4BBD7A0F9FBD7529053D3A45B43CFD33943DA617C33CC48D29BDC4DB453DF1822F3DC8EE4ABD4510473D382F96BD7F7E8ABD5881823D4A43173CB3574B3DCD3AA0BD8C47A8BC2545CB3C389DC93C6C3778BD2B6989BDB3553EBD394D7DBD7650263D63321A3C401B553D74B30CBD3F3B003D2E5F723D312E4F3D4A7454BD416500BDE2EE693D2E59E9BB719644BC4E30903D24513BBD032C0F3D00118CBD02F42C3DF52220BDF9DC123CE164BABCE1B5443C5F8A99BD215D60BD4DA51C3DFF76903DAA5BF9BB6438553DB2908A3B1934C1BB3BD929BD23B7A6BCCE71023DAFD639BC3866AE3C0584A1BC66A790BD630196BD8FAE78BD37BC243C3824A23CF33FB5BC88BAB2BC1BA2C8BC22DFE3BC6257653D9ACF963DF203C93C7FE5043D0A29E2BCC7CA78BD0B40C33B8AB7543D71D09FBCC5BC5F3DDFE5FF3CDE6600BD73D004BD2764E5BC02979ABDDF15D03C8AF70CBD2B2B38BD1577913D468B96BDE86395BD10DCB03CFA7367BD40A35ABD4E0A4F3C273B42BD318287BD5CBE70BD4D9B80BDA9155EBDD5E7153B689B463CBC3511BD9FFEEE3BE9EB6DBD9E11A5BBDDB177BD7D532DBD57FAF8BB67436BB92196073CF09205BD018FA0BD98AA46BC68D85ABB63DE94BD6A153BBD312777BD97B5BABCABEB9C3D7622753B97718EBD44A934BCA93F2FBDBD356CBDDDF1E9BB917A973DB8F3F63C92F081BD5F8A27BDCA36CC3C8EC89A3D64BB2ABD4ACEEBBCC7D29DBDF5696EBDA770383D4BAE243CE486E8BC8A894C3D987346BDF7E6DCBCBCE4AE3C9ADDA43DF2E79FBD7DA5FFBC69C3863C4AA0623CAE38973D6AB0733DA3C282BD84284FBCE34140BC2C8EBA3C8A4DDFBBEAD13FBDFE65553B756523BD3956F03CF7FD293DB68B3DBDA0F8673D3C4E07BB95A0033D499F613D500011BDB4F4A33C0808DDBC773CBCBC59B896BDFC538D3CE5DC0A3D53CC7B3CD21000BDBD678A3DB15DEEBB26FD993C842E453C2590433CACD0A0BD2B08A5BD36F081BDC8D593BDA62F713D99448C3D6D76913D87F407BDD43B943D02175EBD7AA7843D10BB983D0BB1CEBC13EA8D3D7D17963D1D13583D6250163D8B8CA5BD29C738BD163CD5BCEBBFD9BC2F5E3B3D515B31BD89F69DBD657D993D3EAED13C7BD6233DF8D08EBDAE05493DF38256BA7A81E6BCB79A59BD908C5FBD63235ABC2B2F87BD6AFA02BD6EDBA6BD83B2103DFFF803BDD2D562BDB34F663DCEDBC93C361644BC0360C83C04BC1A3DC9F6F33C0A19A63CB60164B932B4F6BCC4F750BD546A42BC69955ABD8526A4BD901411BD7CF0C9BB327A9DBB0C2C61BD632E833D568367BD4D1667BDAD2A933DDEC661BD7D80D53C5DE26A3CBEFB5C3C98A96EBD9DFD1A3C6BBCA4BC9B6D503DCA8153BDE12B243D9F561FBD068AC03BD83107BDB2962DBD94BA27BAA572C6BCA915C93B185C8A3D66B5DFBADE4C8F3C01CD983D0F98383DDFF36DBB1C4D8F3B372D8ABDF078F6BCA87EA13DAB3160BC1398793DE869843D66A9453D98EA263DF17C30BD924F4C3DC015203D7BA952BCFCCF6BBD4E271BBD0AED7C3CF300E23CFE290F3D94B95DBD871D473D10D990BD0B349EBDEDCB953DFFCA753D60E366BDBCDD2E3B343A8DBCE19C6B3D3289FA3BEC4B7CBD01275C3D0CEF5CB9A600213D6C42D9BC143039BD957D81BD63CF19BBA696983D9806293DBA509BBD4F4916BD73734A3D0DFC16BD9D9E4B3D832DDABBBF0C8F3DB257AABBB522CEBCCC579D3C0363A4BCEF33023DAF13873DF560ABBCFF2F043D90C29EBDFA295DBDFE2813BBBC99863DFB0E8B3D56E7A53D07A4C0BC6023FD3AE43F58BD8C10A03DF6B00C3D155256BD3C9C22BD9DC39BBD81D63FBDDFFC593D53A095BD446FA5BDBCFCACBB364EBE3CB78152BC0B7DBD3C35161E3D72C0E1BB2702AC3B7A1EFD39EE619C3C74BB34BD589D4ABD0CE31F3D9BEC453D83599CBDE9A9B0BB85EB3A3CAC3C7F3DF66680BD9FAF0BBDE600E63CAA1669BDEEB282BCD291103D4ABB533D6DBC28BB79BCAABCACBBA0BD00EA0E3D1EBCA03DC15D62BDD41A08BDFD1003BCDE8ABF3BD325813DEC1C993DD24C8FBD1D2EE3BCF4413ABD99C10CBD633686BD43468CBDD27B8BBDADBFFA3C887C2B3C7C2FC9BCAEC7343A25DB4FBDAFCB9F3CE8BD853C584C13BC83371FBDD341D73CDFEA4A3D861435BDA882DCBCC6D19BBD5984DF3C4F470CBD6C5307BC98C789BCBBA48E3D2A4F37BC6EDA03BD23A3BA3C58607B3B074978BD72568F3D1394C4BC8929863D4373AE3BF64F7EBD9937873C320A843D40F1493DB46B773DEA8696BDA53A963DF8DB33BDA0525C3DE7AAD0BC0A61BABB266D9FBD0D23323D396872BD11A49CBD739EA53DC0D505BC402247BD73B2863C4CBE133D4990243CDF5BD73C2F846C3DCF17543DCFA74BBD33C3AB3C6D4391BDEABC0DBD4326613D1B7054BD6A13D93BBD41CB3C074248BC576D6F3D4EEC92BCB630583CE4B0153D1FDBF93BFE57F63C634E17BD3DCB013D0745893D415E4FBD8B47913C028BBA3B719271BD4242303CFE2E75BCF3DA03BC19289ABCF914313DC0A6E63BBCE25A3C9BDD583DE3C1B1BB493F99BD1B1E99BCB8F1373DEDF5233C41A8B83CF50F7E3C58E3733D34B959BCD041AA3C0A4389BD46206C3D7CCF93BD942D033DD91172BD1AB026BDC256573D0AC36FBDE4FD863D68817D3D887091BC4484023DF99A79BD55A032BDDACE9EBD2C7D51BC1190413D00BF883DC3FE87BB00D7873B637749BDFA4E553DA23148BD3B6F8ABD890D31BDEEB8253D2CC94FBD253C61BD079983BD16C4713DF1389C3C212C853DEEBC8A3C709BA5BDB94082BD3177BC3C2DD3FC3C7557173C210781BDFF315CBDC249ACBC183585BDF68A8A3DBABB643D00642DBD022351BDFF624ABD9215A1BB6D1CEF3B9D85823C846CD6BCA9DF4CBB256AA03CAC5F50BD6CABE1BC4A08983D32A14B3DA27E573C0E3A85BD4BF7993CF3DA94BDD9A6AB3CD163E13CD519853CC477ED3AF53C7FBB82326A3D67C80A3D11A8793D35B172BDE43ED43C3759133D43CF493D5485F6BC7C0351BDB42AA43DF3FBBA3CF6FB5E3D2710573D73DF5FBC41F8943DA5575ABD762D0A3D77005CBB06A4663DAB1297BB752973BCB7A20D3D2A7F64BC12C291BDD1F2A03DD4E925BD5799673D22C0D03CB79A77BD209A203DB084B9BC7091E6BCF46387BD45FE20BD29FF853DC7F118BDAAEA1DBDC3A85ABD5EF1EABC0EB7CABC9DDB913D417B90BDFF2F263D741AFBBB0454463D1130823DFC059D3C51332DBDECE3653DB1B0703D5AFCA03DC9029A3D266003BBCE6793BD5D8261BD7FFF49BDD85A583CF248663D0AD0E93C708F66BD134E38BC58E1543D7C1761BD189D8E3CB92A97BDB556E93C479A5E3DB791BBBC84B89FBA7B9E3EBD4EC64FBC9674943D5D3607BDD05FFBBC2DE02FBDFB4541BD4DDA31BBC19E7B3DD826613D20F1063DA138B7BB7F20E1BC9918CC3A0C86313D70E4BABCABD6BBBCBDBA40BDCA2D843DE209B2BC24B7203CE72B973D40FDBB3C23E860BD8F0940BDF52F9CBDC69F023DC9DCA33D8B2522BC21AA37BD04A9503DCFD6B43C927A403DCCEC8FBC58178C3DDA3713BC188121BDB514003CEBA57E3D80280FBD3358B53C887C6D3D062BCDBC5D0E0FBD708E543B4C53143D1D235B3C16E212BDEBD818BD02A9983D11C6983D7F12803D94AF1C3C2ED536BCE37B8FBD03BE373D30D99B3D736F163DA957A6BDB24F18BDAFE55BBB9D48463A44F6313CB994733D6DD9753D2F769DBDD14619BDBD1F573DBC76C53C996D14BD1CC5C13A0AD2693D12958FBDE6467ABD11B6DD3C11F756BD43E88F3D6982993D708C233D9084FA3C687B7EBC0B841E3B867F9B3DAEC39ABDE02E723CA89D9DBD3DC9AE3C251838BC373C11BD9D73043DE5B14B3D6B3C15BDF5389C3D46EB743D3B7040BDBD7C4FBD2C87AD3C0C6D07BDFFAFBABCCFC56CBD1ED2A23DBC8FBEBC8C23EFBCBC20A1BDB475953D418451BDAF1A8C3DE9B1DFBC1B4AF73CD8803FBD3B5E883C977479BD2D24A63D0035D8BBCC921CBCB0CE67BD8179FCBC25FDA03D1C811F3D0A56F33BC5DF1EBD176541BDE066303D44F53F3DE32EADBCAD6F80BDEBA66DBC60DABF3C6E678F3DBFEBE83CC35777BD02F6E13BDD628CBDA21CF13C04DC8BBDA74903BD252A5E3D64C87D3C08AA71BC276BACBCF5C8A33CE47FAFBB1E2E2FBD8C667F3DA629913DF6BEBFBBD164893DD42B323DF5EF3D3D7A0583BD26204BBD5A2D4ABCF2392ABD057352BDDA766B3D54A3773DB20C23BC1ABA70BD8EE2A0BD01D3B23BF49D0FBD625130BDDA7A1BBDF95A9B3DBE2C3DBCB69F5BBD2E6C79BDC876FD3C1523A33D38248F3D08D7933DFCE881BDE76A8B3DB3AC89BD33BAD7BB3F750CBDCC2C8ABDE1F68ABC8C20093D4549983DE8FC863D732A50B844BBAD3C75338E3DF3CA9ABC184E8C3D549867BD8117B1BC32802ABC0FD6DF3A6E5B51BD6E9E39BCF8F485BDA2471E3D1206C6BB7952BCBCFE2E963D574E7BBD547123BD57B4D73C0221CCBB30309FBD4E3C333DB62965BD2D8D5B3D4C67B13CC2573CBD4D6314BDA57A83BC0A13A1391D7A5BBD533A95BBFCEABD3C5B2001BD404B173D493EA03D167F983D519399BD41D8633D061AC2B9C311A03CEE1CA33DA302633DC172C5BC596A843C6D3AB73C2AF3FC3C74EBCABC7B0B72BD0E7A933D4093193C07D4A5BB7EC493BCB04E42BCF79D26BD98CF2D3DF0D68F3B279B4F3CCC24943B8E84DCBCFD7C14BD3D57B33C35CCADBC89CDF03C2D05433B7180E03CEFB00D3D14EFF2BC281FA23C7D7D483D93376C3D7D988DBD942D823D8EEA083D7DACA5BDAC9DA4BD6F10553DA08568BD41D90C3D5DBA543DD2EE643C754B373DC8B5803D69D982BD9C1A05BDF3DF7ABDAB57A6BC7C340B3A78023EBDBFF923BD25F374BCBDCF31BDA0CC003D9B61643D91858BBD097692BDCD04863D8406BC3B9814343DC5EE5F3D980C9B3C5124983D1B4A303DAB9FF03C3D74823DEAB835BD4733C43AF74C803CAD86B83C854CA3BDA713213C3D3C3FBC6B767F3D141B8ABD0DAAA6BC9DFD3E3DB93661BDD2961C3D0464333D37547EBD687C0BBDEA40203D9236FCBCD6A103BD8E4EE03C5FFB0A3D6A7D9DBD78708C3CF8122FBD74209ABD970AA6BD426098BD9190763D9C40A5BCF4A1473CD6D57F3D6D86B6BCE1225F3D7FA4133D35CFA83A890D513D591F6D3D521C28BDDE9B42BDCE06CEBC694C6D3DAD5FA3BD509E943CDD073B3DC12E0DBD205115BD51D564BDFD8C17BD3B8A7BBC2249F63B54CA313DDC7938BDD3BB61BD1D67813D861565BDE7A63E3B3616A03D92D5A4BDDDD518BDAF5E203DBE7C913D47586DBDCBDDCD3C3F320ABDA8028DBD9588953D47AD91BCA2A9713D025D27BC0C62153C94770EBD109B583D1914623D4D7548BB51BFA4BA6F12663D89B1A53D00498EBD7C377A3D58D648BC888185BD3A64623D512A9B3B178D1F3DB1799CBD8EF58FBD01BDC1BC3481683D437F053D806C9C3DEFBA42BD75E3063D9396743D3072EB3B980E4F3C7AF98C3C343142BD7B258CBDEF634A3D2878123D2BA2A4BB05692BBD4035D23B56EB12BD610A9FBC137C003BAC1694BC6BE763BD2A4595BD6DF3DDBB95FBC7BC09E788BCA8D5913DA814783CD8E42C3D85D6BCBC5A70133D59418B3DBCF0B1BC22C79D3DBDB139BC395973BC591A563DCD028FBD1B4D843DB97AA33D41E4203C1028D5BCC1F4003DD1EF12BD2C682CBD9498143C1D179DBD45BF9D3780BA32BD04F61E3D279205BD4B412E3DD4615EBDBF215A3D9C93A5BD89C9253CFBBBE33B750CA03D952E8EBC7D22913D550F3FBC56EAAD3C58A593BD1CB955BAB45362BC3E4407BD66BF93BD0147093D59B3D13ABBD38F3CB11932BD7B69A4BCCBE68D3D24BD1B3DCB1C90BD401D093DCF90333D479B843C795C073DEE30A4BDC9B736BD38BC7F3D79812B3DDC76C7BC0F433C3C10E7033DD6DDF93CF0968DBC910B3BBCF5FAB4BCC3E554BC80E521BDA57E33BD4880EA3C6C57493DB70E113DDCA190BD157F823C2114D13B928A903DFC7C96BC22F965BD3ACEF8BC94834C3D2CD24E3CEB9235BD6DFE8DBD296685BDA9EFCFBA800688BDDAFD2DBDE9CFA63D4FCABABCC73292BC9EE7B53C03E798BBA4D86C3D8778213CA498933D37B2793B422283BDC0E083BDCFFE8B3D8106993DE7C4893DD93A243D58009BBDEE5707BD0AEF0EBD7FB96A3D8B9FB5BC157197BD16C7913D6672883DFF830D3C96BA873C48FC923DC3CA7F3DA342EF3B808A553D5F1C86BD2F31F73BD21B043C67E3D8BBA10997BD7A6893BD6CC782BDB6D8F43CD6EA62BD6F4543BCD5BB30BCCA00DF3C8DA94E3DE8E6C43C50C3643D0FD2B33CEA5600BD9C5F6EBC7AFE14BC480738BC1AF7123DA03C813CFB9F87BD7FE8A6BD3073F8BCAE2C57BD4AC3633D32E71DBC0C6D063C45B9193D5941113D03EDA1BDD07E3FBDC4FA4FBAA9E7983D0B0B39BD14523F3C2CFDB0BC81080F3DE086EABB69074BBDB766CF3C7040873C63188FBCAD23983DA8857FBDC14B9DBDB63949BCEC126F3D0B1B303D5828B1BC693F083D3E0903BDB93A763D9B0FA4BB6BBABB3C72FEED3C58D91C3DBB23283DA5460D3D34367F3DA85C49BCCF8D2ABD0A87DA3C7E43D3BCBE62C63A1CDA8CBD4A1283BD6704673D2BF30FBD2380D8BC43D8963D6DC557BCA9AF97BCCEC8833DEA57E13C85336E3CBBAB93BCF2A370BDCDB0A53DD2CCD13C389D6BBC561F0B3D96B634BD3C1D5ABDFCA33E3DAA0D4FBD7DA88D3DEA2F7A3C4806893D3B169EBD34F61F3D35751ABD8A4767BDF476353D909D9FBD3830193D84423ABDF0D8CD3CEF52693D1D47613BB91B203CA2E393BD2DB7A33D2D009CBC8DF27D3D29055C3CDC6A0EBA52E37F3D174D963D404D993DC457A13C3BF223BDC3AFD53C9D904CBD76AA2BBB8852713D339A9ABD4AF55FBCAD33053DBCCEF3BC9CEAC3BB65B36F3CC65B3EBD2A403EBD2A954C3DEB539EBDD4C29BBD262278BD41CA80BC138969BD5651963DAF6C54BD1824993DCE3493BDE2E893BDFCD6593D4C613ABD29E517BB2FA7413C20461EBD59F570BD2BC3223C5F7BA33D6BE72DBDB304413D0968A93CF081513D398D1B3D0EBFD23C0BD961BDE1D8393DF19B433C309145BC03C425BD07D4983D00B72ABD45FA82BDE97C813D53E978BDD7B6603CC13BD83C6B68CBBC9058FEBC396EF13CAEA8433D87667A3D621F853D3809023D750AD3BC423098BC6198283D9CCE873D0DA061BDF9A573BD362C093C67E2B93AF9F98CBD02808A3DAB6A253D74BD833C55C8033B81789F3D1480A63D1341593DAE6DE83C69F19ABDDC3424BD6FE1A3BC1BD99DBD72AB813DC033A53C5C3495BD73FB12BDBFFE783D7C594A3B9A4971BC8E9797BCB7BD51BDDCB19DBD574984BB9FD176BDF1099F3DB25892BD698E56BD6064E0BBCEED8E3D4CEB633C6B77D33C9A0EBC3A15B464BD9CB1593DE60390BDAE0791BDCDD33ABDB74E21BD6EF00E3D11108A3D351809BCA1C39EBDA136753D355A14BDE7204A3C8C4C87BDBA5CA13CDBC227BD110FBABC7B40113CA1ADC73C046A863D248E87BD9073A53DDAB827BDC7FA74BD00DEC0BCF4DF91BD0078DCBB5DE8A7BCB486633DC03D8F3D3CEDD13CA54A4EBD3F938ABD5CC687BDE3517E3C129D2BBC4894193DF6EE02BDA5AB773D7FFE19BD41388C3C63AF5EBD503C963D8A7F0EBDD9F53FBDC144B43CE3A7713DA243653D8F51923C34330DBD11D0253D098F5CBD493123BDB7D34B3D637521BD5505FABC2C8E3E3DCAEF903C57AC803D1D45A3BD132D5B3D09CA483D2F94393C696981BD71E7CEBB270DAFBCE7C81DBCBA83263DD2E35CBC3C9CEEBC950578BD1DC41F3CC2A4653D9AE8753DFEB39BBD5E55EB3B2CB0E23B37B1213D06E042BC16905F3D8867353D3E9B4EBD10C10F3D95DA07BD74C38EBD4DECF73CBFF5803D72B4623D7BE95EBD028B8F3D69DBABBC4533E7BCDE6A123D60E5B2BC8DA48C3D757BA0BD2CC3D03CCCEF2EBDA577EA3CDB8D5DBCC0039BBD78F80D3DA11D1FBCDFEE4A3D4E6E4A3C1E8B6EBD4BE0D93C7918043C9CA33CBD7FADDDBC3C2114BDB8F5A4BD857A793D487C053DA0E69DBD3D8A02BD3C78643D655390BDD782263B483F2A3C1F7E8D3D2EB5BA3C9295E5BC308772BD025059BD15EF2E3C35B56DBC07F99DBDDF2664BD27DDA23C52B0893CD3DCD1BC625C9CBD08664C3D0881AABCAE22733D267E283DD3507CBD414864B93C6B47BD55E3F33CD91B96BD98BB29BDED91A33C9082443DF95008BDB9BCF43A0218A53D349280BBC02F143DEE1F4ABDA59159BCA65F5BBD55A3853D50BF88BCF992DBBC6B63A43C41D2973D0B36953DAB0A3BBD1DF01BBC5B50633D2293E63CB8AB313D177594BD400768BD6BB1E4BB2D6A92BCA5B0403BAC92503DA6479BBDD4AA843CBC83633DDC115CBD374F45BC8EE6993CD009F9BC6976A3BC9BD0543D87D25F3DF80838BDE3F084BC16A80DBC0E6F59BD4F5BF53C1EE2F7BC910E2D3D19779739A09C83BD6C87463D08F00EBDDC0D83BDF40F67BC981C95BD202EB33AEBA0FABC99666C3DA32F7E3CCAFF9ABDD48B7EBD9ADD44BDB0679FBDD71189BBA59485BD67728BBD2C0F87BD5B237C3D0707223DD19D393BB8DA203D724F243DC1E182BB60252DBDD2FE01BD23DF503C6F16A8BBD373863C4B049ABBFB5F9DBDC1F598BDF027EF3C2F8D8CBD502EA43D78C49BBB84649ABDEDF3733D4D74883D856A9A3CA5A3FB3C58A89EBD2C3A343D938926BD33EFA6BDDD6B0B3DEA82FC3C004E5BBD889D46BCE8E412BDDE4F883D84998E3D046B51BD3D861EBDC33D883DB2537A3D7096803D9AFE98BD70A40BBDDA8BA23B000020BC68F4B13C8DEEB63C7512713D7B9283BD8FF498BDC9F447BBAB02943C386F74BD6F5E1D3CFB60BFBBB35AEDBB860662BDBF5FB1BCFB732B3D675135BD14B458BD05D1A4BDDF6F673D4FBC8DBDD5C1223D60B263BDBCF6773D621997BC7DF4083DD2E7CF39EAD57E3B81CD55BDB7E4BBBC53F334BCAD05003DCF349EBDDC238C3DFB539DBB42C46B3D2AEC02BC57EE1DBD22CC283DCC96943DD7FB183D5984A1BD2DB215BD786D1A3DA19C603CA599D9BC341822BD3AA9A7BC35F4743C99BA773BD109733CB336EC3C59700DBD2B9C553D37324CBD3C1A33BD298E3E3C4B03E03B45E089BD9FD602BD3C0D723B30819F3D16A174BD98DE65BD723F683C1CDABF3C66D3A4BD019592BDF0FB863D9301C93B7E6A2DBD1DFE9D3D726FE43844E9F43C3C6FE03CE8EDC2BB67BB4F3B3185323DCD27EE3BF4EE1EBDEC1C15BD58BFDC3CB11F28BDEA6B9C3D45494FBDF24E67BA1F5A323C66D1963DA9C8933D368D9E3D3E83B63CB9154E3C8FBF8B3D70A95F3DA15D763C220BA2BDD42D84BDFBCC243D993C82BD84676D3D150EAB3CF3A16ABD300C3FBDC01A23BD4880173D073B9B3DDB9B8EBD2D048E3D6140CFBCD7D309BDA5CCCBBCF8CB4A3D6E38D03CB9E85DBD1ABE0E3C35ED193D05910D3C8689713D01AED8BB609C033D5D2124BC6915943D88F5783DF5FB3D3D277A84BD556818BC593E92BDCBAD373C5ECF343D316B3CBC43C54A3B51F0B2BC63A381BD6AB0363D3ABF443B1DC620BDA3610BBD3972823B42042D3DF79945BC4E202EBBAB00A13D5A5F6CBD9FE23FBDDF7E1F3B05DCF93BE6F6363CBDF467BCC81213BDACC2313D52555BBD886E2BBD7C5380BDF6C3443936CA27BDEBBDFD3C648B79BD4D765DBC57D68B3DFF95C1BB91AFEB3C3F5015BCB63C9A3D7BF53EBDA184853C3F6291BD2926773B96AFBA3C242BC63CF16B8B3D68F81FBCAE4981BDB945FE399DF2B6BC15F516BD1371903D15AE95BD02B1A3BD58FCA0BDE6702BBCD5494C3D87DA9EBDF82C663CBA9E3A3DE53B99BD4B26F33CC73BB1BC48521B3D0BB6993D44273F3D865189BD64D0293D29CA7E3DB9C88ABD486F673B17BD8F3DC458363DF1E4083D36DBF03ABAE3383D1F74993C1A61993D59E26C3B1269A5BDA0CFA2BD8B24333DBB5754BDCC7ECA3BB8C8B23B865AFEBC12FD0CB900E9D53C534B7DBDEA9C643D24D656BD042146BDB5CE16BD4AD7B0BC509B45BCDDF6BDBAF278753DD64271BD694F87BDCB3BA2BCC50C443D639097BCA27B853D4E3FD3BC4146493D2558453DFF8BA0BD1F9B8C3DFF139CBCD1309FBBDFA5473DF7D6BF3AA3F80ABCD1FAA4BD3A326BBD02537D3DACF865BB675C823CC61B483D62F2493DB5C5793DCC2E95BD3EE480BCEE301BBCB4C2663D08D29F3C2B7270BC70265ABDF8F5A3BB82BC923D36A4213D77CF2A3D4418F13CB14586BC9C6FC03C3B6E883DDF290B3D0BA0B63C58E3623DDFC1683D43EE8D3C7BBD55BC35D81EBD81FA9F3DA44E483CF63732BDE20744BCB8FE5ABD129604BD59B452BD4B97DC3CC4EE55BDB6D79CBD338DC6BCB54B833DA806D63CA55DCDBB0971873DC4F52C3D3341633DF5E65ABD0B06953D99B80C3D2FC38E3D9C03833DDB356DBDEA9849BC8D5032BD51FF883D2837023D3DB1FBBC3943C93CEEC225BDAF55403BFD65763D1D6C66BDCDFCE7BCFA15CDBC0FA993BCED420A3C01DA873D30D2013BB70FF33C9B0E88BD88DB073D65EE8CBD9F8025BDEEDA9BBDDD24A8BC0FFF2FBD39BD173DA6A1983C0E79543DB405EA3BF079ECBCAA694FBD9304D1BC609C333D5478A5BD2728863D32F0623D2C14C9BCB7C5733D38FCB2BC9E92453CDEF36F3D4C47843C120DA7BD5E838CBD46FF7BBCCE9C573B44399A3CDEDE993D4783D33BCC1030BDEA724CBDEE374CBD3BF7A0BD238D8EBD54BB943D0748E23CBB6C323D519CA3BB7C8BF73B6342943DFA1075BDABA7803DF80E53BC4668E0BC50D1E3BC70C5893DAA1A1DBCB8B91D3DA8EE60BD8337853C6C807F3DD5D3A53DB4A8A2BD285697BD8D8374BDC812A53D75D81DBCF0AA32BD1346353C6E0D50BDA3C7943DC54930BC86E034BDADD830BD2826C93CEE3882BD27546B3DF5408D3DA083F2BB85E881BDE7A7543D6B3511BD5C5C84BDD12F3E3C47D9B4BC8EB6ED3B80855E3D91F3C1BCF81C513D6EEF753D5AB4833D8EE487BB84EF6EBB63A310BD0C9A76BC30BB68BDB64D47BDD31E7DBD1EADADBC81ABBABCA47E2D3BA8EC3C3D92C941BD119652BD965BA63D8A44993D128BEBBCE333913DAB5B27BD5943CB3CFD0911BDD1CB9CBDCE7AA63D9F195FBD4C744A3DCDFB02BD59CFEEBA468050BD77C6E4BCC52B8D3DCF03DABCD4554D3D8E7935BD836351BDEF78943DB2CE16BCCA16D0BCEF7C6E3D3231123D40CF98BDE2AB8DBBEDEA90BDA1074DBD3F5056BC9A3E03BD0714253DF9EC8BBDC86C323B9E68A3BDD126BBBCD89B493DF9479EBC887A833DDE8DBA3C5D246FBD3387773D94AE893D6FDC8C3DD61C82BCFA1BF93A21EE543D583165BDFCC5BCBC3E28B13C41F630BDCF22833D792D89BD0399313D2AF01CBD9E3F78BDC64794BDD63698BDF624213D8006043DE0F7CBBC031DC6BC502377BD01A5EFBC88E9A1BB2BF5453B7D644F3C1307923C6A9FFEBCDC1350BDAEF7693D072CA0BD9D6512BDBB85733D4014AD3C07EA66BB98831DBD2075E6BC78933ABD7EED5FBC",
      torch_tensor_120_400_torch.float32: 