#map = affine_map<(d0, d1, d2, d3) -> (d1)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3, d1)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, 0)>
#map4 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, 0)>
#map5 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, d3)>
#map6 = affine_map<(d0, d1, d2, d3) -> (d3)>
#map7 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d1, d2)>
#map8 = affine_map<(d0, d1) -> (d0, d1)>
#map9 = affine_map<(d0, d1) -> (d1, d0)>
#map10 = affine_map<(d0, d1, d2, d3) -> (d2, d3)>
#map11 = affine_map<(d0, d1, d2, d3) -> (d1, 0, 0)>
#map12 = affine_map<(d0, d1, d2, d3) -> (0, 0, 0, 0)>
#map13 = affine_map<(d0, d1, d2, d3) -> (0, 0, 0, d3)>
#map14 = affine_map<(d0, d1) -> (0, d1)>
#map15 = affine_map<(d0, d1) -> (d1)>
module attributes {torch.debug_module_name = "ConvNeXt"} {
  ml_program.global private mutable @global_seed(dense<0> : tensor<i64>) : tensor<i64>
  func.func @forward(%arg0: tensor<1x3x224x224xf32>) -> tensor<1x1000xf32> {
    %cst = arith.constant dense_resource<__elided__> : tensor<1000xf32>
    %cst_0 = arith.constant dense_resource<__elided__> : tensor<1000x768xf32>
    %cst_1 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_2 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_3 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_4 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_5 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_6 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_7 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_8 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_9 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_10 = arith.constant dense_resource<__elided__> : tensor<768x1x7x7xf32>
    %cst_11 = arith.constant dense_resource<__elided__> : tensor<768x1x1xf32>
    %cst_12 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_13 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_14 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_15 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_16 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_17 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_18 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_19 = arith.constant dense_resource<__elided__> : tensor<768x1x7x7xf32>
    %cst_20 = arith.constant dense_resource<__elided__> : tensor<768x1x1xf32>
    %cst_21 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_22 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_23 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_24 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_25 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_26 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_27 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_28 = arith.constant dense_resource<__elided__> : tensor<768x1x7x7xf32>
    %cst_29 = arith.constant dense_resource<__elided__> : tensor<768x1x1xf32>
    %cst_30 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_31 = arith.constant dense_resource<__elided__> : tensor<768x384x2x2xf32>
    %cst_32 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_33 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_34 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_35 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_36 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_37 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_38 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_39 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_40 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_41 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_42 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_43 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_44 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_45 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_46 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_47 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_48 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_49 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_50 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_51 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_52 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_53 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_54 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_55 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_56 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_57 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_58 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_59 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_60 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_61 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_62 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_63 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_64 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_65 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_66 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_67 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_68 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_69 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_70 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_71 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_72 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_73 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_74 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_75 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_76 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_77 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_78 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_79 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_80 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_81 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_82 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_83 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_84 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_85 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_86 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_87 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_88 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_89 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_90 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_91 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_92 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_93 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_94 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_95 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_96 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_97 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_98 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_99 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_100 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_101 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_102 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_103 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_104 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_105 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_106 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_107 = arith.constant dense_resource<__elided__> : tensor<384x1536xf32>
    %cst_108 = arith.constant dense_resource<__elided__> : tensor<1536xf32>
    %cst_109 = arith.constant dense_resource<__elided__> : tensor<1536x384xf32>
    %cst_110 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_111 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_112 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_113 = arith.constant dense_resource<__elided__> : tensor<384x1x7x7xf32>
    %cst_114 = arith.constant dense_resource<__elided__> : tensor<384x1x1xf32>
    %cst_115 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_116 = arith.constant dense_resource<__elided__> : tensor<384x192x2x2xf32>
    %cst_117 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_118 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_119 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_120 = arith.constant dense_resource<__elided__> : tensor<192x768xf32>
    %cst_121 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_122 = arith.constant dense_resource<__elided__> : tensor<768x192xf32>
    %cst_123 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_124 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_125 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_126 = arith.constant dense_resource<__elided__> : tensor<192x1x7x7xf32>
    %cst_127 = arith.constant dense_resource<__elided__> : tensor<192x1x1xf32>
    %cst_128 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_129 = arith.constant dense_resource<__elided__> : tensor<192x768xf32>
    %cst_130 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_131 = arith.constant dense_resource<__elided__> : tensor<768x192xf32>
    %cst_132 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_133 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_134 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_135 = arith.constant dense_resource<__elided__> : tensor<192x1x7x7xf32>
    %cst_136 = arith.constant dense_resource<__elided__> : tensor<192x1x1xf32>
    %cst_137 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_138 = arith.constant dense_resource<__elided__> : tensor<192x768xf32>
    %cst_139 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_140 = arith.constant dense_resource<__elided__> : tensor<768x192xf32>
    %cst_141 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_142 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_143 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_144 = arith.constant dense_resource<__elided__> : tensor<192x1x7x7xf32>
    %cst_145 = arith.constant dense_resource<__elided__> : tensor<192x1x1xf32>
    %cst_146 = arith.constant dense_resource<__elided__> : tensor<192xf32>
    %cst_147 = arith.constant dense_resource<__elided__> : tensor<192x96x2x2xf32>
    %cst_148 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_149 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_150 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_151 = arith.constant dense_resource<__elided__> : tensor<96x384xf32>
    %cst_152 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_153 = arith.constant dense_resource<__elided__> : tensor<384x96xf32>
    %cst_154 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_155 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_156 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_157 = arith.constant dense_resource<__elided__> : tensor<96x1x7x7xf32>
    %cst_158 = arith.constant dense_resource<__elided__> : tensor<96x1x1xf32>
    %cst_159 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_160 = arith.constant dense_resource<__elided__> : tensor<96x384xf32>
    %cst_161 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_162 = arith.constant dense_resource<__elided__> : tensor<384x96xf32>
    %cst_163 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_164 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_165 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_166 = arith.constant dense_resource<__elided__> : tensor<96x1x7x7xf32>
    %cst_167 = arith.constant dense_resource<__elided__> : tensor<96x1x1xf32>
    %cst_168 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_169 = arith.constant dense_resource<__elided__> : tensor<96x384xf32>
    %cst_170 = arith.constant dense_resource<__elided__> : tensor<384xf32>
    %cst_171 = arith.constant dense_resource<__elided__> : tensor<384x96xf32>
    %cst_172 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_173 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_174 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_175 = arith.constant dense_resource<__elided__> : tensor<96x1x7x7xf32>
    %cst_176 = arith.constant dense_resource<__elided__> : tensor<96x1x1xf32>
    %cst_177 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_178 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_179 = arith.constant dense_resource<__elided__> : tensor<96xf32>
    %cst_180 = arith.constant dense_resource<__elided__> : tensor<96x3x4x4xf32>
    %cst_181 = arith.constant 0.000000e+00 : f32
    %cst_182 = arith.constant 1.000000e+00 : f32
    %cst_183 = arith.constant 1.41421354 : f32
    %cst_184 = arith.constant 5.000000e-01 : f32
    %cst_185 = arith.constant 9.9999999999999995E-7 : f64
    %cst_186 = arith.constant 9.600000e+01 : f32
    %c0 = arith.constant 0 : index
    %c3 = arith.constant 3 : index
    %cst_187 = arith.constant 1.920000e+02 : f32
    %cst_188 = arith.constant 3.840000e+02 : f32
    %cst_189 = arith.constant 7.680000e+02 : f32
    %cst_190 = arith.constant 4.900000e+01 : f32
    %0 = tensor.empty() : tensor<1x96x56x56xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%cst_179 : tensor<96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %2 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<4> : vector<2xi64>} ins(%arg0, %cst_180 : tensor<1x3x224x224xf32>, tensor<96x3x4x4xf32>) outs(%1 : tensor<1x96x56x56xf32>) -> tensor<1x96x56x56xf32>
    %3 = tensor.empty() : tensor<1x56x56x96xf32>
    %4 = linalg.generic {indexing_maps = [#map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%2 : tensor<1x96x56x56xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %5 = tensor.empty() : tensor<1x56x56x1xf32>
    %6 = linalg.fill ins(%cst_181 : f32) outs(%5 : tensor<1x56x56x1xf32>) -> tensor<1x56x56x1xf32>
    %7 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%4 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %8 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%7 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %9 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%8 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %10 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%4, %9 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.subf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %11 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%10, %10 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %12 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%11 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %13 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%12 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %14 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%13 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.truncf %cst_185 : f64 to f32
      %690 = arith.addf %in, %689 : f32
      linalg.yield %690 : f32
    } -> tensor<1x56x56x1xf32>
    %15 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%14 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = math.rsqrt %in : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %16 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%15 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %17 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%10, %16 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %18 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%17, %cst_178 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %19 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%18, %cst_177 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %20 = linalg.generic {indexing_maps = [#map1, #map7], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%19 : tensor<1x56x56x96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %padded = tensor.pad %20 low[0, 0, 3, 3] high[0, 0, 3, 3] {
    ^bb0(%arg1: index, %arg2: index, %arg3: index, %arg4: index):
      tensor.yield %cst_181 : f32
    } : tensor<1x96x56x56xf32> to tensor<1x96x62x62xf32>
    %21 = linalg.generic {indexing_maps = [#map, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%cst_174 : tensor<96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %collapsed = tensor.collapse_shape %cst_175 [[0, 1], [2], [3]] : tensor<96x1x7x7xf32> into tensor<96x7x7xf32>
    %22 = linalg.depthwise_conv_2d_nchw_chw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%padded, %collapsed : tensor<1x96x62x62xf32>, tensor<96x7x7xf32>) outs(%21 : tensor<1x96x56x56xf32>) -> tensor<1x96x56x56xf32>
    %23 = linalg.generic {indexing_maps = [#map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%22 : tensor<1x96x56x56xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %24 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%23 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %25 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%24 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %26 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%25 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %27 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%23, %26 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.subf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %28 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%27, %27 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %29 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%28 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %30 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%29 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %31 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%30 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.truncf %cst_185 : f64 to f32
      %690 = arith.addf %in, %689 : f32
      linalg.yield %690 : f32
    } -> tensor<1x56x56x1xf32>
    %32 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%31 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = math.rsqrt %in : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %33 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%32 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %34 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%27, %33 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %35 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%34, %cst_173 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %36 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%35, %cst_172 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %37 = tensor.empty() : tensor<96x384xf32>
    %38 = linalg.generic {indexing_maps = [#map8, #map9], iterator_types = ["parallel", "parallel"]} ins(%cst_171 : tensor<384x96xf32>) outs(%37 : tensor<96x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<96x384xf32>
    %39 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%36 : tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %40 = tensor.empty() : tensor<1x56x96x384xf32>
    %41 = linalg.generic {indexing_maps = [#map10, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%38 : tensor<96x384xf32>) outs(%40 : tensor<1x56x96x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x96x384xf32>
    %collapsed_191 = tensor.collapse_shape %39 [[0, 1], [2], [3]] : tensor<1x56x56x96xf32> into tensor<56x56x96xf32>
    %collapsed_192 = tensor.collapse_shape %41 [[0, 1], [2], [3]] : tensor<1x56x96x384xf32> into tensor<56x96x384xf32>
    %42 = tensor.empty() : tensor<56x56x384xf32>
    %43 = linalg.fill ins(%cst_181 : f32) outs(%42 : tensor<56x56x384xf32>) -> tensor<56x56x384xf32>
    %44 = linalg.batch_matmul ins(%collapsed_191, %collapsed_192 : tensor<56x56x96xf32>, tensor<56x96x384xf32>) outs(%43 : tensor<56x56x384xf32>) -> tensor<56x56x384xf32>
    %expanded = tensor.expand_shape %44 [[0, 1], [2], [3]] : tensor<56x56x384xf32> into tensor<1x56x56x384xf32>
    %45 = tensor.empty() : tensor<1x56x56x384xf32>
    %46 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded, %cst_170 : tensor<1x56x56x384xf32>, tensor<384xf32>) outs(%45 : tensor<1x56x56x384xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x384xf32>
    %47 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%46 : tensor<1x56x56x384xf32>) outs(%45 : tensor<1x56x56x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_183 : f32
      %690 = math.erf %689 : f32
      %691 = arith.addf %690, %cst_182 : f32
      %692 = arith.mulf %691, %cst_184 : f32
      %693 = arith.mulf %in, %692 : f32
      linalg.yield %693 : f32
    } -> tensor<1x56x56x384xf32>
    %48 = tensor.empty() : tensor<384x96xf32>
    %49 = linalg.generic {indexing_maps = [#map8, #map9], iterator_types = ["parallel", "parallel"]} ins(%cst_169 : tensor<96x384xf32>) outs(%48 : tensor<384x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<384x96xf32>
    %50 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%47 : tensor<1x56x56x384xf32>) outs(%45 : tensor<1x56x56x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x384xf32>
    %51 = tensor.empty() : tensor<1x56x384x96xf32>
    %52 = linalg.generic {indexing_maps = [#map10, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%49 : tensor<384x96xf32>) outs(%51 : tensor<1x56x384x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x384x96xf32>
    %collapsed_193 = tensor.collapse_shape %50 [[0, 1], [2], [3]] : tensor<1x56x56x384xf32> into tensor<56x56x384xf32>
    %collapsed_194 = tensor.collapse_shape %52 [[0, 1], [2], [3]] : tensor<1x56x384x96xf32> into tensor<56x384x96xf32>
    %53 = tensor.empty() : tensor<56x56x96xf32>
    %54 = linalg.fill ins(%cst_181 : f32) outs(%53 : tensor<56x56x96xf32>) -> tensor<56x56x96xf32>
    %55 = linalg.batch_matmul ins(%collapsed_193, %collapsed_194 : tensor<56x56x384xf32>, tensor<56x384x96xf32>) outs(%54 : tensor<56x56x96xf32>) -> tensor<56x56x96xf32>
    %expanded_195 = tensor.expand_shape %55 [[0, 1], [2], [3]] : tensor<56x56x96xf32> into tensor<1x56x56x96xf32>
    %56 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_195, %cst_168 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %57 = linalg.generic {indexing_maps = [#map1, #map7], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%56 : tensor<1x56x56x96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %58 = linalg.generic {indexing_maps = [#map11, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%cst_176, %57 : tensor<96x1x1xf32>, tensor<1x96x56x56xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x96x56x56xf32>
    %59 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%58, %20 : tensor<1x96x56x56xf32>, tensor<1x96x56x56xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x96x56x56xf32>
    %padded_196 = tensor.pad %59 low[0, 0, 3, 3] high[0, 0, 3, 3] {
    ^bb0(%arg1: index, %arg2: index, %arg3: index, %arg4: index):
      tensor.yield %cst_181 : f32
    } : tensor<1x96x56x56xf32> to tensor<1x96x62x62xf32>
    %60 = linalg.generic {indexing_maps = [#map, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%cst_165 : tensor<96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %collapsed_197 = tensor.collapse_shape %cst_166 [[0, 1], [2], [3]] : tensor<96x1x7x7xf32> into tensor<96x7x7xf32>
    %61 = linalg.depthwise_conv_2d_nchw_chw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%padded_196, %collapsed_197 : tensor<1x96x62x62xf32>, tensor<96x7x7xf32>) outs(%60 : tensor<1x96x56x56xf32>) -> tensor<1x96x56x56xf32>
    %62 = linalg.generic {indexing_maps = [#map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%61 : tensor<1x96x56x56xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %63 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%62 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %64 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%63 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %65 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%64 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %66 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%62, %65 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.subf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %67 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%66, %66 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %68 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%67 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %69 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%68 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %70 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%69 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.truncf %cst_185 : f64 to f32
      %690 = arith.addf %in, %689 : f32
      linalg.yield %690 : f32
    } -> tensor<1x56x56x1xf32>
    %71 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%70 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = math.rsqrt %in : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %72 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%71 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %73 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%66, %72 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %74 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%73, %cst_164 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %75 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%74, %cst_163 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %76 = linalg.generic {indexing_maps = [#map8, #map9], iterator_types = ["parallel", "parallel"]} ins(%cst_162 : tensor<384x96xf32>) outs(%37 : tensor<96x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<96x384xf32>
    %77 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%75 : tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %78 = linalg.generic {indexing_maps = [#map10, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%76 : tensor<96x384xf32>) outs(%40 : tensor<1x56x96x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x96x384xf32>
    %collapsed_198 = tensor.collapse_shape %77 [[0, 1], [2], [3]] : tensor<1x56x56x96xf32> into tensor<56x56x96xf32>
    %collapsed_199 = tensor.collapse_shape %78 [[0, 1], [2], [3]] : tensor<1x56x96x384xf32> into tensor<56x96x384xf32>
    %79 = linalg.batch_matmul ins(%collapsed_198, %collapsed_199 : tensor<56x56x96xf32>, tensor<56x96x384xf32>) outs(%43 : tensor<56x56x384xf32>) -> tensor<56x56x384xf32>
    %expanded_200 = tensor.expand_shape %79 [[0, 1], [2], [3]] : tensor<56x56x384xf32> into tensor<1x56x56x384xf32>
    %80 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_200, %cst_161 : tensor<1x56x56x384xf32>, tensor<384xf32>) outs(%45 : tensor<1x56x56x384xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x384xf32>
    %81 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%80 : tensor<1x56x56x384xf32>) outs(%45 : tensor<1x56x56x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_183 : f32
      %690 = math.erf %689 : f32
      %691 = arith.addf %690, %cst_182 : f32
      %692 = arith.mulf %691, %cst_184 : f32
      %693 = arith.mulf %in, %692 : f32
      linalg.yield %693 : f32
    } -> tensor<1x56x56x384xf32>
    %82 = linalg.generic {indexing_maps = [#map8, #map9], iterator_types = ["parallel", "parallel"]} ins(%cst_160 : tensor<96x384xf32>) outs(%48 : tensor<384x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<384x96xf32>
    %83 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%81 : tensor<1x56x56x384xf32>) outs(%45 : tensor<1x56x56x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x384xf32>
    %84 = linalg.generic {indexing_maps = [#map10, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%82 : tensor<384x96xf32>) outs(%51 : tensor<1x56x384x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x384x96xf32>
    %collapsed_201 = tensor.collapse_shape %83 [[0, 1], [2], [3]] : tensor<1x56x56x384xf32> into tensor<56x56x384xf32>
    %collapsed_202 = tensor.collapse_shape %84 [[0, 1], [2], [3]] : tensor<1x56x384x96xf32> into tensor<56x384x96xf32>
    %85 = linalg.batch_matmul ins(%collapsed_201, %collapsed_202 : tensor<56x56x384xf32>, tensor<56x384x96xf32>) outs(%54 : tensor<56x56x96xf32>) -> tensor<56x56x96xf32>
    %expanded_203 = tensor.expand_shape %85 [[0, 1], [2], [3]] : tensor<56x56x96xf32> into tensor<1x56x56x96xf32>
    %86 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_203, %cst_159 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %87 = linalg.generic {indexing_maps = [#map1, #map7], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%86 : tensor<1x56x56x96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %88 = linalg.generic {indexing_maps = [#map11, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%cst_167, %87 : tensor<96x1x1xf32>, tensor<1x96x56x56xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x96x56x56xf32>
    %89 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%88, %59 : tensor<1x96x56x56xf32>, tensor<1x96x56x56xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x96x56x56xf32>
    %padded_204 = tensor.pad %89 low[0, 0, 3, 3] high[0, 0, 3, 3] {
    ^bb0(%arg1: index, %arg2: index, %arg3: index, %arg4: index):
      tensor.yield %cst_181 : f32
    } : tensor<1x96x56x56xf32> to tensor<1x96x62x62xf32>
    %90 = linalg.generic {indexing_maps = [#map, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%cst_156 : tensor<96xf32>) outs(%0 : tensor<1x96x56x56xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x96x56x56xf32>
    %collapsed_205 = tensor.collapse_shape %cst_157 [[0, 1], [2], [3]] : tensor<96x1x7x7xf32> into tensor<96x7x7xf32>
    %91 = linalg.depthwise_conv_2d_nchw_chw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%padded_204, %collapsed_205 : tensor<1x96x62x62xf32>, tensor<96x7x7xf32>) outs(%90 : tensor<1x96x56x56xf32>) -> tensor<1x96x56x56xf32>
    %92 = linalg.generic {indexing_maps = [#map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%91 : tensor<1x96x56x56xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %93 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%92 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %94 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%93 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %95 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%94 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %96 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%92, %95 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.subf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %97 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%96, %96 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %98 = linalg.generic {indexing_maps = [#map1, #map3], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%97 : tensor<1x56x56x96xf32>) outs(%6 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.addf %in, %out : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %99 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%98 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.divf %in, %cst_186 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %100 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%99 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = arith.truncf %cst_185 : f64 to f32
      %690 = arith.addf %in, %689 : f32
      linalg.yield %690 : f32
    } -> tensor<1x56x56x1xf32>
    %101 = linalg.generic {indexing_maps = [#map4, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%100 : tensor<1x56x56x1xf32>) outs(%5 : tensor<1x56x56x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %689 = math.rsqrt %in : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x1xf32>
    %102 = linalg.generic {indexing_maps = [#map3, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%101 : tensor<1x56x56x1xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %103 = linalg.generic {indexing_maps = [#map5, #map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%96, %102 : tensor<1x56x56x96xf32>, tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %104 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%103, %cst_155 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.mulf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %105 = linalg.generic {indexing_maps = [#map5, #map6, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%104, %cst_154 : tensor<1x56x56x96xf32>, tensor<96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %in_333: f32, %out: f32):
      %689 = arith.addf %in, %in_333 : f32
      linalg.yield %689 : f32
    } -> tensor<1x56x56x96xf32>
    %106 = linalg.generic {indexing_maps = [#map8, #map9], iterator_types = ["parallel", "parallel"]} ins(%cst_153 : tensor<384x96xf32>) outs(%37 : tensor<96x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<96x384xf32>
    %107 = linalg.generic {indexing_maps = [#map5, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%105 : tensor<1x56x56x96xf32>) outs(%3 : tensor<1x56x56x96xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x56x96xf32>
    %108 = linalg.generic {indexing_maps = [#map10, #map1], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%106 : tensor<96x384xf32>) outs(%40 : tensor<1x56x96x384xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x56x96x384xf32>
    %collapsed_206 = tensor.collapse_shape %107 [[0, 1], [2], [3]] : tensor<1x56x56x96xf32> into tensor<56x56x96xf32>
    %collapsed_207 = tensor.collapse_shape %108 [[0, 1], [2], [3]] : tensor<1x56x96x384xf32> into tensor<56x96x384xf32>
